artillery-tests/artillery.yml
config:
  target: "http://0.0.0.0:8080"
  phases:
    - duration: 60
      arrivalRate: 20
    - duration: 60
      arrivalRate: 40
    - duration: 60
      arrivalRate: 60

variables:
  cities: ["Austin", "New York", "Chicago", "Los Angeles", "San Francisco"]

scenarios:
  - flow:
      - get:
<<<<<<< HEAD
          url: "/api/v1/breweries/{{ cities }}?count=20"
=======
          url: "/api/v1/breweries/Austin?count=20"
>>>>>>> 3847f577d56c0c3cd7fd3f5a770785334509e1d6