artillery-tests/artillery.yml
config:
  target: "http://0.0.0.0:8080"
  phases:
    - duration: 60
      arrivalRate: 20
    - duration: 60
      arrivalRate: 40

scenarios:
  - name: Test with Austin
    flow:
      - get:
          url: "/api/v1/breweries/Austin?count=20"
  - name: Test with Denver
    flow:
      - get:
          url: "/api/v1/breweries/Denver?count=20"
  - name: Test with Chicago
    flow:
      - get:
          url: "/api/v1/breweries/Chicago?count=20"